app/controllers/locations_controller.rb

SELECT  "locations".* FROM "locations"  WHERE "locations"."id" = ? LIMIT 1  [["id", 5]]
---
		def show
			@oneLocation = Location.find(params[:id])