app/controllers/visits_controller.rb

SELECT  "locations".* FROM "locations"  WHERE "locations"."id" = ? LIMIT 1  [["id", 5]]
---
	def index
    	@location = Location.find(params[:location_id])